[
    {
        "id" : 1,
      "name": "Frozen shrimp seafood black tiger prawn OEM box style packaging",
      "category": "Frozen Fish",
      "image": "https://i.ibb.co/4WKYnKZ/it1.jpg",
      "description": "Fresh Shrimp contains many nutrients, including iodine and antioxidants, that may offer health benefits. It’s quite nutritious and provides high amounts of certain nutrients, such as iodine, that aren’t abundant in many other foods. On the other hand, some people claim that shrimp is unhealthy due to its high cholesterol content. Additionally, it’s commonly believed that farm-raised shrimp may have some negative health effects compared with wild-caught Frozen shrimp.This article explores the evidence to determine if Fresh shrimp is a healthy food to include in your diet.",
      "current_price": "11.14",
      "price" : "$11.14-$14.65 / Kgs",
      "MOQ" : "15.000 Kilograms",
      "Storage_Type": "frozen Under -18 Degrees",
      "Place_of_Origin": "Bangladesh",
      "Ingredients" : "Protine",
      "Variety" : "Black Tiger Shrimp",
      "Freezing_Process": "IQF  Lobster Big Sizes",
      "Part" : "Whole",
      "Brand_Name" : "Custome",
      "Specification" : "Frozen Fish",
      "Content" : "FISH",
      "Instruction_for_use" : "Cook before eat",
      "Drying_Process" : "AD",
      "Weight" : "0.2 kg",
      "Packing" : "10/20KG",
      "Delivery_time" : "7-14 Days",
      "Cooking" : "Fresh Shrimp Heart and brain health. Many studies have found astaxanthin may help strengthen arteries, which may reduce the risk of heart attacks. It may also help increase levels of high-density lipoprotein (HDL), or “good” cholesterol, an important factor in heart health. In addition, astaxanthin may be beneficial for brain health. Its anti-inflammatory properties may prevent damage to your brain cells that often leads to memory loss and neurodegenerative diseases, such as Alzheimer’s. Despite these findings, more human research is needed to determine the overall role that the astaxanthin in Frozen shrimp. Wholesale may have on overall health"
    },

    {
        "id" : 2,
      "name": "Best Quality Lobsters Healthy Seafood Items with High Quality",
      "category": "Frozen Fish",
      "image": "https://i.ibb.co/dLvBZ7x/it2.jpg",
      "description": "Our Frozen Tilapia is a great way to enter the world of fish. It is filleted and quickly frozen to ensure the freshest product when you defrost it. We love having a stock of Wholesale Frozen TilFresh Lobsters is harvested from the cold, pristine waters off the cost of Nova Scotia. It’s well known for its black, hard shell and full body characteristic. Our strict protocols maintain our  lobster in grade A condition. Our monitored holding tanks are specially designed to mimic the lobster’s natural environment, producing a strong, well seasoned lobster. We select only the strongest lobsters, with the highest protein level for our live market. They are handled with great care, every step of the way in order to minimize stress levels",
      "current_price": "27.71",
      "price" : "$27.71-$30.14 / Kgs",
      "MOQ" : "5000kg",
      "Storage_Type": " frozen",
      "Place_of_Origin": "Zhejiang, China",
      "Ingredients" : "Frozen lobster",
      "Variety" : "Rock lobster",
      "Freezing_Process": "IQF  Lobster Big Sizes",
      "Part" : "Whole",
      "Brand_Name" : "Custome",
      "Specification" : "Rock lobster",
      "Content" : "sea food",
      "Instruction_for_use" : "Fry, Cook",
      "Drying_Process" : "AD",
      "Weight" : "0.100",
      "Packing" : "10kg/carton",
      "Delivery_time" : "7-14 Days",
      "Cooking" : "Now you can enjoy the taste of fresh Maine lobster from Beal’s Lobster Pier all year long. With our Beal’s at Home service, we ship fresh, live lobsters overnight to your home anywhere in the U.S. Skip the cook time and select our new pre-cooked option so you can enjoy our savory lobster even sooner! No matter how you receive your lobster, we’ll include easy to follow instructions on how to prepare and crack into your lobster."
    },

    {
        "id" : 3,
      "name": "Eel Fish 100% Frozen Export Oriented High Quality Cheap Price",
      "category": "Frozen Fish",
      "image": "https://i.ibb.co/T857hrg/it3.jpg",
      "description": "Frozen Eel contains many nutrients, including iodine and antioxidants, that may offer health benefits.Frozen Eel is an iconic species—Delicious, nourishing, and as dynamic as your mind. There are no pin bones in it so that the boneless flesh can be easily managed. It has white meat, which is flaky, juicy, and a little sweet. Wholesale Frozen Eel is a great combination for taste and nutrients, with its high saturated oil, flaky consistency and rich flavor. The best cooking technique for this fish is fried, baked, smoked, stewed, grilled or sautéed. Eels’ form is snake-like. This feature has kept many individuals from testing them.",
      "current_price": "2.35",
      "price" : "$2.35-$5.40 / Kgs",
      "MOQ" : "10000kg",
      "Storage_Type": "Keep frozen under -18C",
      "Place_of_Origin": "Bangladesh",
      "Ingredients" : "Frozen Conger Pike Eel Steak Wild Caught",
      "Variety" : "Freshwater Drum",
      "Freezing_Process": "IQF  Lobster Big Sizes",
      "Part" : "Whole 60 cm",
      "Brand_Name" : "Custome",
      "Specification" : "Frozen Conger Pike Eel Steak Wild Caught",
      "Content" : "frozen fresh eel",
      "Instruction_for_use" : "Cook thoroughly",
      "Drying_Process" : "AD",
      "Weight" : "0.6 kg",
      "Packing" : "Slice 12cm/pcs",
      "Delivery_time" : "7-14 Days",
      "Cooking" : "The Frozen Eel are sold as dressed, whole or headless. Eels that will be Wholesale Frozen Eel whole should be kept alive for sufficient time to cleanse before they are completely frozen. Whole eels are often stored in bags individually. The eels would intertwine, which makes it hard to thaw and manage them. A suitable alternative approach of sorting includes stunning them and freezing them separately. Eels can be filleted, but when cooked with the bone, the fish meat is still easy to extract, and no tiny bones complicate the process. Some people preferred skinning the eels before cooking. The flesh of this freshwater fish, known as unagi, can also be used in sushi"
    },

    {
        "id": 4,
        "name": "Mud Crab 100% Fresh Export Oriented High Quality Cheap Price",
        "category": "Fresh Crab",
        "image": "https://i.ibb.co/R6ZdWPN/it4.jpg",
        "description": "Fresh Mud Crab is a premium seafood choice known for its sweet, succulent meat and rich flavor. These crabs are highly nutritious, packed with vitamins and minerals, making them an excellent addition to a healthy diet. Mud Crabs are versatile and can be prepared in various ways, including steaming, boiling, grilling, or sautéing. Their tender meat is perfect for a variety of dishes, from traditional Asian recipes to gourmet seafood cuisine.",
        "current_price": "3.50",
        "price": "$3.50-$6.75 / Kgs",
        "MOQ": "5000kg",
        "Storage_Type": "Keep refrigerated at 0-4C",
        "Place_of_Origin": "Bangladesh",
        "Ingredients": "Fresh Mud Crab, Wild Caught",
        "Variety": "Scylla Serrata",
        "Freezing_Process": "Fresh, Refrigerated",
        "Part": "Whole",
        "Brand_Name": "Custom",
        "Specification": "Fresh Mud Crab, Wild Caught",
        "Content": "Fresh mud crab",
        "Instruction_for_use": "Cook thoroughly",
        "Drying_Process": "None",
        "Weight": "0.5-1.5 kg per crab",
        "Packing": "Individually packed",
        "Delivery_time": "7-14 Days",
        "Cooking": "Mud Crabs are sold whole and can be stored alive until ready to cook. Before cooking, crabs should be cleaned thoroughly. Popular methods of cooking include steaming, boiling, and grilling. The sweet, tender meat is best enjoyed fresh and is commonly used in dishes like crab curry, chili crab, and crab salads."
    },

    {
        "id" : 5,
      "name": "Wholesale Frozen Tilapia Fresh Tilapia Supplier Block Bulk for sale",
      "category": "Frozen Fish",
      "image": "https://i.ibb.co/VJJNthV/it5.jpg",
      "description": "Our Frozen Tilapia is a great way to enter the world of fish. It is filleted and quickly frozen to ensure the freshest product when you defrost it. We love having a stock of Wholesale Frozen Tilapia in our freezer to satisfy any craving we get, ready to add to any dish we fancy. Tilapia is very mild but does have a slightly sweet flavor. Although it is pinkish when raw, it cooks to create a white, firm and flaky fish dish. As it’s mild, it can be a blank canvas and goes with almost any cuisine you can imagine. Coat it in batter, herbs, spices, or whatever you fancy; this fish perfectly complements a healthy dinner option. It’s great in curries or pasta, with salads or fries. The choice is yours, and you will not be disappointed. Wholesale Frozen Tilapia is low in calories and a great source of protein. If you are keen on exercise, watching your weight or looking for a beautifully versatile fish, tilapia is the place to start.",
      "current_price": "450.15",
      "price" : "$1.40-$2.60 / Kgs",
      "MOQ" : "10000 Kgs",
      "Storage_Type": " frozen",
      "Place_of_Origin": "Bangladesh",
      "Ingredients" : "None",
      "Variety" : "Unknown",
      "Freezing_Process": "IQF",
      "Part" : "Whole",
      "Brand_Name" : "Custome",
      "Specification" : "FROZEN TILAPIA",
      "Content" : "FISH + WATER",
      "Instruction_for_use" : "THAWED THEN COOKED",
      "Drying_Process" : "AD",
      "Weight" : "10",
      "Packing" : "10kg/ctn Bulk Packing",
      "Delivery_time" : "7-14 Days",
      "Cooking" : "Cook time will vary depending on the size filets you have of course. Sometimes they are whole like you see here, others have been cut in half so keep that in mind. If you are staying in a small space without a lot of appliances you can actually cook frozen fish in a microwave! We will start with that method.",
      "Bake" : "Baking frozen fish actually turns out really well. It isn’t just for this type of white fish either, you can do it with any type of fillet. You do not want to overcook fish, that is my worst pet peeve. The thickest part should reach a safe 140 degrees F and remember that when it rests it will rise another 5 degrees or so too. Using a meat thermometer is helpful to get it just right.That depends on how large your pieces are. The typical cook time will range from 20-25 minutes or so until the middle is white and can be cut easily with a fork. Flaky and tender is ideal.Now we are going to talk about frozen fish baked in the oven. Most of us have one of these in our houses and unless it is super hot outside it is my method of choice for this.I will share a few ideas we love to pair with fish recipes in general below. Of course there are many others, just choose those that cook at 375 for about 20 minutes too."
    }
]